# 1.	Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

chislo = input('Введите трехзначное число: ', )
cifra1 = int(chislo[0])
cifra2 = int(chislo[1])
cifra3 = int(chislo[2])
print('Сумма цифр числа: ', cifra1 + cifra2 + cifra3)
print('Произведение цифр числа: ', cifra1 * cifra2 * cifra3)

